---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.IdenticalGeometryCopiesInArray
source: html/5fef1e46-680d-f8e4-c29a-d28352fe9e10.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.IdenticalGeometryCopiesInArray Property

This array contains multiple copies of some identical geometry. Performance might be improved by using a nested family and arraying copies of its instances.

## Syntax (C#)
```csharp
public static FailureDefinitionId IdenticalGeometryCopiesInArray { get; }
```